tap "homebrew/bundle"
tap "homebrew/services"

tap "dannycjones/tap"

# Core Packages (wanted ASAP)

cask "font-meslo-lg-nerd-font"
cask "firefox"
cask "google-chrome"
brew "fzf"
cask "iterm2"
cask "secretive"
brew "starship"
brew "stow"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-autosuggestions"

brew "mas"
mas "Amphetamine", id: 937984704
mas "1Password", id: 443987910
mas "Bitwarden", id: 1352778147

# Misc packages

brew "ansible"
brew "asdf"
brew "awscli"
cask "backblaze"
brew "boxes"
brew "cmatrix"
brew "coreutils"
cask "discord"
brew "figlet"
brew "ffmpeg"
brew "git"
brew "gh"
brew "git-delta"
brew "hugo"
brew "htop"
brew "iperf3"
brew "jq"
cask "minecraft"
brew "ncdu"
cask "nordvpn"
brew "openssh"
brew "python3"
brew "restic"
brew "rustup"
brew "ssh-copy-id"
brew "stress"
brew "speedtest-cli"
cask "spotify"
cask "steam"
brew "syncthing", restart_service: true
cask "tailscale-app"
brew "tmux"
cask "tor-browser"
cask "transmission"
brew "uv"
cask "visual-studio-code"
cask "vlc"
brew "watch"
cask "webtorrent"
cask "whatsapp"
brew "yt-dlp"
brew "yubico-piv-tool"
brew "ykman"
brew "rsync"
brew "iproute2mac"
